tap "cloudflare/cloudflare"
tap "cmacrae/formulae"
tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "mczachurski/wallpapper"
tap "neovim/neovim"
tap "rcmdnk/file"
tap "xwmx/taps"
# Icons for the GNOME project
brew "adwaita-icon-theme"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Plugin manager for zsh, inspired by oh-my-zsh and vundle
brew "antigen"
# Command-line fuzzy finder written in Go
brew "fzf"
# Clock, timer, time manager and ASCII+ text-art viewer for the terminal
brew "arttime"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Cross platform file encryption utility using blowfish
brew "bcrypt"
# Swiss army knife for network attacks and monitoring
brew "bettercap"
# Secure and free password manager for all of your devices
brew "bitwarden-cli"
# Deduplicating archiver with compression and authenticated encryption
brew "borgbackup"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Emacs dependency management
brew "cask"
# Anti-virus software
brew "clamav"
# Console Matrix
brew "cmatrix"
# Configurable talking characters in ASCII art
brew "cowsay"
# Message bus system, providing inter-application communication
brew "dbus"
# Secure communications between a client and a DNS resolver
brew "dnscrypt-proxy", restart_service: true
# Pack, ship and run any application as a lightweight container
brew "docker"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# Modern replacement for 'ls'
brew "exa"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Command-line outline and bitmap font editor/converter
brew "fontforge"
# Infamous electronic fortune-cookie generator
brew "fortune"
# GNU compiler collection
brew "gcc"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Enable transparent encryption/decryption of files in a git repo
brew "git-crypt"
# Small git utilities
brew "git-extras"
# Alternative to top/htop
brew "glances"
# Render markdown on the CLI
brew "glow"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# GNU grep, egrep and fgrep
brew "grep"
# Toolkit for creating graphical user interfaces
brew "gtk+3"
# System monitoring dashboard for terminal
brew "gtop"
# CLI email client written in Rust
brew "himalaya"
# Text-based UI library
brew "ncurses"
# Improved top (interactive process viewer)
brew "htop"
# Command-line benchmarking tool
brew "hyperfine"
# Tool to report network interface bandwidth
brew "ifstat"
# Lightweight and flexible command-line JSON processor
brew "jq"
# C++ bittorrent library with Python bindings
brew "libtorrent-rasterbar"
# Rainbows and unicorns in your console!
brew "lolcat"
# Security and system auditing tool to harden systems
brew "lynis"
# Swiss Army Knife for macOS
brew "m-cli"
# Keep your Mac's application settings in sync
brew "mackup"
# Mac App Store command-line interface
brew "mas"
# Open source relational database management system
brew "mysql", restart_service: true
# Get, set, and list display resolution
brew "screenresolution"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Tiny, lightning fast, feature-packed file manager
brew "nnn"
# Manage multiple Node.js versions
brew "nvm"
# Development kit for the Java programming language
brew "openjdk"
# Animated pipes terminal screensaver
brew "pipes-sh"
# GNOME Python bindings (based on GObject Introspection)
brew "pygobject3"
# CPU/RAM/battery stats chart bar for tmux (and GNU screen)
brew "rainbarf"
# Ruby version manager
brew "rbenv"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Rootkit hunter
brew "rkhunter"
# Safe, concurrent, practical language
brew "rust"
# Display and control your Android device
brew "scrcpy"
# Tools to write and execute C#
brew "scriptcs"
# Sample multi-channel audio mixer library
brew "sdl2_mixer"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Change macOS audio source from the command-line
brew "switchaudio-osx"
# System performance benchmark tool
brew "sysbench"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Text interface for Git repositories
brew "tig"
# Terminal multiplexer
brew "tmux"
# Digital clock in ncurses
brew "tty-clock"
# Converts a ttyrec file into gif files
brew "ttygif"
# Vi 'workalike' with many additional features
brew "vim"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# HTTP benchmarking tool
brew "wrk"
# JavaScript package manager
brew "yarn"
# UNIX shell (command interpreter)
brew "zsh"
# Additional completion definitions for zsh
brew "zsh-completions"
# Cloudflare Tunnel
brew "cloudflare/cloudflare/cloudflared", link: false
# Custom macOS statusbar with shell plugin, interaction and graph support
brew "felixkratz/formulae/sketchybar"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai"
# Brewfile manager for Homebrew.
brew "rcmdnk/file/brew-file"
# GPU-accelerated terminal emulator
cask "alacritty"
# Desktop password and login vault
cask "bitwarden", args: { appdir: "/Applications" }
# Screen saver based on animations presented during Apple Special Event Brooklyn
cask "brooklyn"
# Web security testing toolkit
cask "burp-suite", args: { appdir: "/Applications" }
# Web browser
cask "firefox", args: { appdir: "/Applications" }
# Developer targeted fonts with a high number of glyphs
cask "font-3270-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-agave-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-anonymice-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-arimo-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-aurulent-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-aurulent-sans-mono-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-bigblue-terminal-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-bitstream-vera-sans-mono-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-blex-mono-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-caskaydia-cove-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-code-new-roman-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-comic-shanns-mono-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-cousine-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-daddy-time-mono-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-dejavu-sans-mono-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-droid-sans-mono-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-fantasque-sans-mono-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-fira-code-nerd-font"
cask "font-fira-mono", args: { appdir: "/Applications" }
# Developer targeted fonts with a high number of glyphs
cask "font-fira-mono-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-go-mono-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-gohufont-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-hack-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-hasklug-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-heavy-data-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-hurmit-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-im-writing-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-inconsolata-go-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-inconsolata-lgc-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-inconsolata-nerd-font"
# Sans-serif, slab-serif, monospace and quasi‑proportional typeface family
cask "font-iosevka"
# Developer targeted fonts with a high number of glyphs
cask "font-iosevka-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-iosevka-term-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-jetbrains-mono-nerd-font"
# Monospaced typeface designed for programming in Julia
cask "font-juliamono"
# Developer targeted fonts with a high number of glyphs
cask "font-lekton-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-liberation-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-lilex-nerd-font"
# Nerd Font font with round corners
cask "font-maple"
# Developer targeted fonts with a high number of glyphs
cask "font-meslo-lg-nerd-font"
# Monospaced programming font inspired by the Minecraft typeface
cask "font-monocraft"
# Monospaced font inspired by the Minecraft typeface patched to add Nerd glyphs
cask "font-monocraft-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-monofur-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-monoid-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-mononoki-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-mplus-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-noto-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-open-dyslexic-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-overpass-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-profont-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-proggy-clean-tt-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-roboto-mono-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-sauce-code-pro-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-shure-tech-mono-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-space-mono-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-symbols-only-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-terminess-ttf-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-tinos-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-ubuntu-mono-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-ubuntu-nerd-font"
# Monospaced font with cursive italics and programming symbol ligatures
cask "font-victor-mono"
# Developer targeted fonts with a high number of glyphs
cask "font-victor-mono-nerd-font"
# Tools to protect your emails and files
cask "gpg-suite", args: { appdir: "/Applications" }
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Keyboard customizer
cask "karabiner-elements"
# File system integration
cask "macfuse"
# Open-source download manager
cask "motrix"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Free and open source web app scanner
cask "owasp-zap", args: { appdir: "/Applications" }
# Command-line shell and scripting language
cask "powershell"
# Control your tools with a few keystrokes
cask "raycast"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Tool that provides consistent, highly configurable symbols for apps
cask "sf-symbols"
# Music streaming service
cask "spotify", args: { appdir: "/Applications" }
# System monitor for the menu bar
cask "stats"
# Text editor for code, markup and prose
cask "sublime-text"
# Real time file synchronization software
cask "syncthing"
# Disk encryption software focusing on security based on TrueCrypt
cask "veracrypt", args: { appdir: "/Applications" }
# Open-source code editor
cask "visual-studio-code"
# Network protocol analyzer
cask "wireshark", args: { appdir: "/Applications" }
mas "Bitwarden", id: 1352778147
mas "GarageBand", id: 682658836
mas "Telegram", id: 747648890
mas "Xcode", id: 497799835
vscode "aaron-bond.better-comments"
vscode "adpyke.codesnap"
vscode "analytic-signal.preview-html"
vscode "bale.theme-darkplusplus"
vscode "bbenoist.shell"
vscode "bierner.color-info"
vscode "bierner.lit-html"
vscode "bmalehorn.shell-syntax"
vscode "bos.codeheader"
vscode "bradlc.vscode-tailwindcss"
vscode "burkeholland.simple-react-snippets"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "ecmel.vscode-html-css"
vscode "EditorConfig.EditorConfig"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "foxundermoon.shell-format"
vscode "GitHub.codespaces"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "GitHub.remotehub"
vscode "github.vscode-github-actions"
vscode "GitLab.gitlab-workflow"
vscode "GrapeCity.gc-excelviewer"
vscode "heyimfuzz.banner-comments"
vscode "HTMLHint.vscode-htmlhint"
vscode "idered.npm"
vscode "jeremyrajan.react-component"
vscode "jeremyrajan.webpack"
vscode "kennylong.kubernetes-yaml-formatter"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "kristjantammekivi.npm-utils"
vscode "MainaWycliffe.view-package-on-npm"
vscode "medo64.code-point"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.black-formatter"
vscode "ms-python.isort"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.live-server"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-typescript-next"
vscode "msjsdiag.vscode-react-native"
vscode "naumovs.color-highlight"
vscode "PKief.material-icon-theme"
vscode "PKief.material-product-icons"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.LiveServer"
vscode "Tailscale.vscode-tailscale"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "WallabyJs.console-ninja"
vscode "wix.vscode-import-cost"
vscode "XadillaX.viml"
vscode "yoavbls.pretty-ts-errors"
